tiborsimon/embedded-tdd-headers/pic/pic12/pic12f1612_tdd.h
#define T6HLT                         522
#define T6HLT_MODE0                   523
#define T6HLT_MODE                    524
#define T6MODE0                       525
#define T6MODE                        526
#define T6HLT_MODE1                   527
#define T6MODE1                       528
#define T6MODE2                       529
#define T6HLT_MODE2                   530
#define T6HLT_MODE3                   531
#define T6MODE3                       532
#define T6CKSYNC                      533
#define T6HLT_CKSYNC                  534
#define T6CKPOL                       535
#define T6HLT_CKPOL                   536
#define T6PSYNC                       537
#define T6HLT_PSYNC                   538
#define T6CLKCON                      539
#define T6CS                          540
#define T6CS0                         541
#define T6CS1                         542
#define T6CS2                         543
#define T6RST                         544
#define T6RST_RSEL                    545
#define T6RST_RSEL0                   546
#define T6RSEL                        547
#define T6RSEL0                       548
#define T6RST_RSEL1                   549
#define T6RSEL1                       550
#define T6RSEL2                       551
#define T6RST_RSEL2                   552
#define T6RST_RSEL3                   553
#define T6RSEL3                       554
#define CWG1DBR0                      555
#define CWG1DBR                       556
#define DBR                           557
#define DBR0                          558
#define CWG1DBR1                      559
#define DBR1                          560
#define CWG1DBR2                      561
#define DBR2                          562
#define CWG1DBR3                      563
#define DBR3                          564
#define CWG1DBR4                      565
#define DBR4                          566
#define CWG1DBR5                      567
#define DBR5                          568
#define CWG1DBF                       569
#define CWG1DBF0                      570
#define DBF                           571
#define DBF0                          572
#define CWG1DBF1                      573
#define DBF1                          574
#define CWG1DBF2                      575
#define DBF2                          576
#define CWG1DBF3                      577
#define DBF3                          578
#define CWG1DBF4                      579
#define DBF4                          580
#define DBF5                          581
#define CWG1DBF5                      582
#define CWG1AS0                       583
#define CWG1LSAC                      584
#define LSAC                          585
#define LSAC0                         586
#define CWG1LSAC0                     587
#define LSAC1                         588
#define CWG1LSAC1                     589
#define LSBD0                         590
#define CWG1LSBD0                     591
#define LSBD                          592
#define CWG1LSBD                      593
#define LSBD1                         594
#define CWG1LSBD1                     595
#define CWG1REN                       596
#define REN                           597
#define CWG1SHUTDOWN                  598
#define SHUTDOWN                      599
#define CWG1AS1                       600
#define INAS                          601
#define CWG1INAS                      602
#define C1AS                          603
#define CWG1C1AS                      604
#define C2AS                          605
#define CWG1C2AS                      606
#define TMR2AS                        607
#define CWG1TMR2AS                    608
#define CWG1TMR4AS                    609
#define TMR4AS                        610
#define CWG1TMR6AS                    611
#define TMR6AS                        612
#define CWG1OCON0                     613
#define CWG1STRA                      614
#define STRA                          615
#define STRB                          616
#define CWG1STRB                      617
#define CWG1STRC                      618
#define STRC                          619
#define CWG1STRD                      620
#define STRD                          621
#define OVRA                          622
#define CWG1OVRA                      623
#define CWG1OVRB                      624
#define OVRB                          625
#define OVRC                          626
#define CWG1OVRC                      627
#define OVRD                          628
#define CWG1OVRD                      629
#define CWG1CON0                      630
#define CWG1MODE0                     631
#define CWG1CON0_MODE0                632
#define CWG1MODE                      633
#define CWG1CON0_MODE                 634
#define CWG1MODE1                     635
#define CWG1CON0_MODE1                636
#define CWG1MODE2                     637
#define CWG1CON0_MODE2                638
#define LD                            639
#define CWG1LD                        640
#define CWG1CON0_EN                   641
#define CWG1EN                        642
#define G1EN                          643
#define CWG1CON1                      644
#define CWG1POLA                      645
#define POLA                          646
#define CWG1POLB                      647
#define POLB                          648
#define CWG1POLC                      649
#define POLC                          650
#define CWG1POLD                      651
#define POLD                          652
#define IN                            653
#define CWG1IN                        654
#define CWG1OCON1                     655
#define CWG1OEA                       656
#define OEA                           657
#define CWG1OEB                       658
#define OEB                           659
#define CWG1OEC                       660
#define OEC                           661
#define CWG1OED                       662
#define OED                           663
#define CWG1CLKCON                    664
#define CS                            665
#define CWG1CS                        666
#define CWG1ISM                       667
#define CWG1IS                        668
#define IS                            669
#define IS0                           670
#define CWG1IS0                       671
#define CWG1IS1                       672
#define IS1                           673
#define IS2                           674
#define CWG1IS2                       675
#define WDTCON0                       676
#define SWDTEN                        677
#define SEN                           678
#define WDTSEN                        679
#define WDTPS                         680
#define WDTPS0                        681
#define WDTPS1                        682
#define WDTPS2                        683
#define WDTPS3                        684
#define WDTPS4                        685
#define WDTCON1                       686
#define WDTWINDOW0                    687
#define WINDOW0                       688
#define WINDOW                        689
#define WDTWINDOW                     690
#define WDTWINDOW1                    691
#define WINDOW1                       692
#define WDTWINDOW2                    693
#define WINDOW2                       694
#define WDTCS                         695
#define WDTCS0                        696
#define WDTCS1                        697
#define WDTCS2                        698
#define WDTPSL                        699
#define WDTPSL_WDTPSCNT               700
#define WDTPSL_PSCNT                  701
#define WDTPSCNT0                     702
#define PSCNT0                        703
#define WDTPSCNT1                     704
#define PSCNT1                        705
#define WDTPSCNT2                     706
#define PSCNT2                        707
#define WDTPSCNT3                     708
#define PSCNT3                        709
#define WDTPSCNT4                     710
#define PSCNT4                        711
#define WDTPSCNT5                     712
#define PSCNT5                        713
#define WDTPSCNT6                     714
#define PSCNT6                        715
#define WDTPSCNT7                     716
#define PSCNT7                        717
#define WDTPSH                        718
#define PSCNT8                        719
#define WDTPSH_WDTPSCNT               720
#define WDTPSH_PSCNT                  721
#define WDTPSCNT8                     722
#define PSCNT9                        723
#define WDTPSCNT9                     724
#define PSCNT10                       725
#define WDTPSCNT10                    726
#define PSCNT11                       727
#define WDTPSCNT11                    728
#define PSCNT12                       729
#define WDTPSCNT12                    730
#define PSCNT13                       731
#define WDTPSCNT13                    732
#define PSCNT14                       733
#define WDTPSCNT14                    734
#define PSCNT15                       735
#define WDTPSCNT15                    736
#define PSCNT16                       737
#define WDTPSCNT16                    738
#define WDTPSCNT17                    739
#define PSCNT17                       740
#define STATE                         741
#define WDTSTATE                      742
#define WDTTMR                        743
#define WDTTMR0                       744
#define WDTTMR1                       745
#define WDTTMR2                       746
#define WDTTMR3                       747
#define WDTTMR4                       748
#define SCANLADRL                     749
#define SCANLADRL_LADR                750
#define LDAR0                         751
#define SCANLADRL_SCANLADR            752
#define SCANLADR0                     753
#define SCANLADR1                     754
#define LDAR1                         755
#define LADR2                         756
#define SCANLADR2                     757
#define LADR3                         758
#define SCANLADR3                     759
#define LADR4                         760
#define SCANLADR4                     761
#define LADR5                         762
#define SCANLADR5                     763
#define SCANLADR6                     764
#define LADR6                         765
#define LADR7                         766
#define SCANLADR7                     767
#define SCANLADRH                     768
#define LADR8                         769
#define SCANLADRH_SCANLADR            770
#define SCANLADR8                     771
#define SCANLADRH_LADR                772
#define LADR9                         773
#define SCANLADR9                     774
#define LADR10                        775
#define SCANLADR10                    776
#define SCANLADR11                    777
#define LADR11                        778
#define LADR12                        779
#define SCANLADR12                    780
#define LADR13                        781
#define SCANLADR13                    782
#define LADR14                        783
#define SCANLADR14                    784
#define LADR15                        785
#define SCANLADR15                    786
#define SCANHADRL                     787
#define SCANHADR0                     788
#define HADR0                         789
#define SCANHADRL_HADR                790
#define SCANHADRL_SCANHADR            791
#define SCANHADR1                     792
#define HADR1                         793
#define SCANHADR2                     794
#define HARD2                         795
#define SCANHADR3                     796
#define HADR3                         797
#define SCANHADR4                     798
#define HADR4                         799
#define SCANHADR5                     800
#define HADR5                         801
#define SCANHADR6                     802
#define HADR6                         803
#define SCANHADR7                     804
#define HADR7                         805
#define SCANHADRH                     806
#define HADR8                         807
#define SCANHADRH_SCANHADR            808
#define SCANHADR8                     809
#define SCANHADRH_HADR                810
#define HADR9                         811
#define SCANHADR9                     812
#define HADR10                        813
#define SCANHADR10                    814
#define SCANHADR11                    815
#define HADR11                        816
#define HADR12                        817
#define SCANHADR12                    818
#define HADR13                        819
#define SCANHADR13                    820
#define HADR14                        821
#define SCANHADR14                    822
#define HADR15                        823
#define SCANHADR15                    824
#define SCANCON0                      825
#define SCANMODE                      826
#define SCANMODE0                     827
#define SCANCON0_MODE                 828
#define SCANCON0_MODE0                829
#define SCANCON0_MODE1                830
#define SCANMODE1                     831
#define INTM                          832
#define SCANINTM                      833
#define INVALID                       834
#define SCANINVALID                   835
#define SCANCON0_BUSY                 836
#define SCANBUSY                      837
#define SCANGO                        838
#define SCANEN                        839
#define SCANCON0_EN                   840
#define SCANTRIG                      841
#define TSEL0                         842
#define TSEL                          843
#define SCANTSEL0                     844
#define SCANTSEL                      845
#define TSEL1                         846
#define SCANTSEL1                     847
#define CRCDATL                       848
#define CRCDATL_DAT                   849
#define CRCDAT0                       850
#define DAT0                          851
#define CRCDATL_CRCDAT                852
#define CRCDAT1                       853
#define DAT1                          854
#define CRCDAT2                       855
#define DAT2                          856
#define CRCDAT3                       857
#define DAT3                          858
#define CRCDAT4                       859
#define DAT4                          860
#define CRCDAT5                       861
#define DAT5                          862
#define CRCDAT6                       863
#define DAT6                          864
#define DAT7                          865
#define CRDCDAT7                      866
#define CRCDATH                       867
#define CRCDAT8                       868
#define DAT8                          869
#define CRCDATH_CRCDAT                870
#define CRCDATH_DAT                   871
#define CRCDAT9                       872
#define DAT9                          873
#define DAT10                         874
#define CRCDAT10                      875
#define DAT11                         876
#define CRCDAT11                      877
#define DAT12                         878
#define CRCDAT12                      879
#define DAT13                         880
#define CRCDAT13                      881
#define DAT14                         882
#define CRCDAT14                      883
#define DAT15                         884
#define CRCDAT15                      885
#define CRCACCL                       886
#define CRCACC0                       887
#define CRCACCL_ACC                   888
#define CRCACCL_CRCACC                889
#define ACC0                          890
#define CRCACC1                       891
#define ACC1                          892
#define CRCACC2                       893
#define ACC2                          894
#define CRCACC3                       895
#define ACC3                          896
#define CRCACC4                       897
#define ACC4                          898
#define CRCACC5                       899
#define ACC5                          900
#define CRCACC6                       901
#define ACC6                          902
#define CRCACC7                       903
#define ACC7                          904
#define CRCACCH                       905
#define CRCACCH_CRCACC                906
#define CRCACC8                       907
#define CRCACCH_ACC                   908
#define ACC8                          909
#define CRCACC9                       910
#define ACC9                          911
#define CRCACC10                      912
#define ACC10                         913
#define CRCACC11                      914
#define ACC11                         915
#define CRCACC12                      916
#define ACC12                         917
#define CRCACC13                      918
#define ACC13                         919
#define ACC14                         920
#define CRCACC14                      921
#define CRCACC15                      922
#define ACC15                         923
#define CRCSHIFTL                     924
#define CRCSHIFTL_CRCSHIFT            925
#define CRCSHIFTL_SHIFT               926
#define SHIFT0                        927
#define CRCSHIFT0                     928
#define SHIFT1                        929
#define CRCSHIFT1                     930
#define SHIFT2                        931
#define CRCSHIFT2                     932
#define SHIFT3                        933
#define CRCSHIFT3                     934
#define SHIFT4                        935
#define CRCSHIFT4                     936
#define SHIFT5                        937
#define CRCSHIFT5                     938
#define SHIFT6                        939
#define CRCSHIFT6                     940
#define SHIFT7                        941
#define CRCSHIFT7                     942
#define CRCSHIFTH                     943
#define CRCSHIFT8                     944
#define CRCSHIFTH_SHIFT               945
#define CRCSHIFTH_CRCSHIFT            946
#define SHIFT8                        947
#define CRCSHIFT9                     948
#define SHIFT9                        949
#define SHIFT10                       950
#define CRCSHIFT10                    951
#define SHIFT11                       952
#define CRCSHIFT11                    953
#define SHIFT12                       954
#define CRCSHIFT12                    955
#define SHIFT13                       956
#define CRCSHIFT13                    957
#define CRCSHIFT14                    958
#define SHIFT14                       959
#define SHIFT15                       960
#define CRCSHIFT15                    961
#define CRCXORL                       962
#define XOR1                          963
#define CRCXOR1                       964
#define XOR2                          965
#define CRCXOR2                       966
#define XOR3                          967
#define CRCXOR3                       968
#define XOR4                          969
#define CRCXOR4                       970
#define XOR5                          971
#define CRCXOR5                       972
#define XOR6                          973
#define CRCXOR6                       974
#define XOR7                          975
#define CRCXOR7                       976
#define CRCXORH                       977
#define XOR8                          978
#define CRCXOR8                       979
#define XOR9                          980
#define CRCXOR9                       981
#define CRCXOR10                      982
#define XOR10                         983
#define CRCXOR11                      984
#define XOR11                         985
#define XOR12                         986
#define CRCXOR12                      987
#define XOR13                         988
#define CRCXOR13                      989
#define CRCXOR14                      990
#define XOR14                         991
#define CRCXOR15                      992
#define XOR15                         993
#define CRCCON0                       994
#define CRCFULL                       995
#define FULL                          996
#define CRCSHIFTM                     997
#define SHIFTM                        998
#define ACCM                          999
#define CRCACCM                       1000
#define CRCCON0_BUSY                  1001
#define CRCBUSY                       1002
#define CRCGO                         1003
#define CRCCON0_EN                    1004
#define CRCEN                         1005
#define CRCCON1                       1006
#define PLEN0                         1007
#define CRCPLEN0                      1008
#define PLEN                          1009
#define CRCPLEN                       1010
#define PLEN1                         1011
#define CRCPLEN1                      1012
#define PLEN2                         1013
#define CRCPLEN2                      1014
#define PLEN3                         1015
#define CRCPLEN3                      1016
#define DLEN                          1017
#define CRCDLEN                       1018
#define CRCDLEN0                      1019
#define DLEN0                         1020
#define DLEN1                         1021
#define CRCDLEN1                      1022
#define CRCDLEN2                      1023
#define DLEN2                         1024
#define DLEN3                         1025
#define CRCDLEN3                      1026
#define SMT1TMRL                      1027
#define SMT1TMR0                      1028
#define SMT1TMRL_SMT1TMR              1029
#define SMT1TMR1                      1030
#define SMT1TMR2                      1031
#define SMT1TMR3                      1032
#define SMT1TMR4                      1033
#define SMT1TMR5                      1034
#define SMT1TMR6                      1035
#define SMT1TMR7                      1036
#define SMT1TMRH                      1037
#define SMT1TMR8                      1038
#define SMT1TMRH_SMT1TMR              1039
#define SMT1TMR9                      1040
#define SMT1TMR10                     1041
#define SMT1TMR11                     1042
#define SMT1TMR12                     1043
#define SMT1TMR13                     1044
#define SMT1TMR14                     1045
#define SMT1TMR15                     1046
#define SMT1TMRU                      1047
#define SMT1TMR16                     1048
#define SMT1TMRU_SMT1TMR              1049
#define SMT1TMR17                     1050
#define SMT1TMR18                     1051
#define SMT1TMR19                     1052
#define SMT1TMR20                     1053
#define SMT1TMR21                     1054
#define SMT1TMR22                     1055
#define SMT1TMR23                     1056
#define SMT1CPRL                      1057
#define SMT1CPRL_SMT1CPR              1058
#define SMT1CPR0                      1059
#define SMT1CPR1                      1060
#define SMT1CPR2                      1061
#define SMT1CPR3                      1062
#define SMT1CPR4                      1063
#define SMT1CPR5                      1064
#define SMT1CPR6                      1065
#define SMT1CPR7                      1066
#define SMT1CPRH                      1067
#define SMT1CPRH_SMT1CPR              1068
#define SMT1CPR8                      1069
#define SMT1CPR9                      1070
#define SMT1CPR10                     1071
#define SMT1CPR11                     1072
#define SMT1CPR12                     1073
#define SMT1CPR13                     1074
#define SMT1CPR14                     1075
#define SMT1CPR15                     1076
#define SMT1CPRU                      1077
#define SMT1CPR16                     1078
#define SMT1CPRU_SMT1CPR              1079
#define SMT1CPR17                     1080
#define SMT1CPR18                     1081
#define SMT1CPR19                     1082
#define SMT1CPR20                     1083
#define SMT1CPR21                     1084
#define SMT1CPR22                     1085
#define SMT1CPR23                     1086
#define SMT1CPWL                      1087
#define SMT1CPW0                      1088
#define SMT1CPWL_SMT1CPW              1089
#define SMT1CPW1                      1090
